Revit 2027 API
SymbolicCurveArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SymbolicCurveArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As SymbolicCurveArrayIterator
public:
virtual SymbolicCurveArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> SymbolicCurveArrayIterator
override ReverseIterator : unit -> SymbolicCurveArrayIterator
Return Value
SymbolicCurveArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace